tap "carlocab/personal"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "terrastruct/d2"
brew "findutils" # GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew "gnu-sed", args: ["with-default-names"] # GNU `sed`, overwriting the built-in `sed`.
brew "gnu-awk", args: ["with-default-names"] # GNU `awk`, overwriting the built-in `awk`.
brew "vim", args: ["with-override-system-vi"] # Always use the latest version of Vim
brew "libpng"
brew "bat"
brew "freetype"
brew "glib"
brew "cmake"
brew "coreutils"
brew "openldap"
brew "curl"
brew "d2"
brew "asdf"
brew "fd"
brew "gnutls"
brew "ffmpeg"
brew "fx"
brew "git"
brew "git-lfs"
brew "jq"
brew "openssh"
brew "peco"
brew "meetingbar" # https://meetingbar.app/
brew "starship"
brew "tree"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "font-hack-nerd-font"
cask "iterm2"
cask "raycast"
cask "fig" # terminal auto completion (https://fig.io/)
cask "tomatobar"
cask "visual-studio-code"
cask "slack"
cask "spotify"
cask "zoom"
cask "docker"
cask "google-chrome"
cask "google-drive"

# aws related
brew "awscli"