tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jakehilborn/jakehilborn"
brew "coreutils"
brew "d2"
brew "gawk"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "jq"
brew "zstd"
brew "mysql"
brew "node"
brew "peco"
brew "tree"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "jakehilborn/jakehilborn/displayplacer"
cask "alfred"
cask "alt-tab"
cask "atom"
cask "authy"
cask "clipy"
cask "diffmerge"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "github"
cask "intellij-idea"
cask "iterm2"
cask "mysqlworkbench"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "xmind"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adisreyaj.swagger-snippets"
vscode "akamud.vscode-theme-onelight"
vscode "aldijav.golangwithdidi"
vscode "AquaSecurityOfficial.trivy-vulnerability-scanner"
vscode "arichika.previewseqdiag-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "candidmetrics.ember-module-snippets"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cweijan.xmind-viewer"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "ElecTreeFrying.auto-import"
vscode "ElecTreeFrying.drag-import-relative-path"
vscode "emberjs.vscode-ember"
vscode "EmberTooling.emberjs"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "HaaLeo.timing"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "jakob101.RelativePath"
vscode "jebbs.plantuml"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jock.svg"
vscode "josa.ember-related-files"
vscode "kkenya.mermaid-sequence-number"
vscode "KnisterPeter.vscode-github"
vscode "lifeart.vscode-ember-unstable"
vscode "lifeart.vscode-glimmer-syntax"
vscode "lokalise.i18n-ally"
vscode "lunuan.kubernetes-templates"
vscode "maciejdems.add-to-gitignore"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mscgenjs.vscode-mscgen"
vscode "netcorext.uuid-generator"
vscode "nhoizey.gremlins"
vscode "nitayneeman.playwright-snippets"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "phanitejakomaravolu.EmberES6Snippets"
vscode "premparihar.gotestexplorer"
vscode "quicktype.quicktype"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "shardulm94.trailing-spaces"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "sysoev.vscode-open-in-github"
vscode "Terrastruct.d2"
vscode "timonwong.shellcheck"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Yog.yog-plantuml-highlight"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
